Repository: adilsakout/wordstock
Catalog: lib/l10n/arb/app_*.arb
Languages: de, es, fr, hi, ko, zh

# goalMasteringWords
source: 📚 Mastering new words
de: 📚 Neue Wörter beherrschen
es: 📚 Dominar palabras nuevas
fr: 📚 Maîtriser de nouveaux mots
hi: 📚 नए शब्दों में महारत हासिल करना
ko: 📚 새로운 단어 마스터하기
zh: 📚 掌握新單字

# goalImprovingMemory
source: 🧠 Improving memory
de: 🧠 Gedächtnis verbessern
es: 🧠 Mejorar la memoria
fr: 🧠 Améliorer la mémoire
hi: 🧠 स्मृति में सुधार करना
ko: 🧠 기억력 향상
zh: 🧠 改善記憶力

# goalSpeakingConfidence
source: 🗣️ Speaking with confidence
de: 🗣️ Selbstbewusst sprechen
es: 🗣️ Hablar con confianza
fr: 🗣️ Parler avec confiance
hi: 🗣️ आत्मविश्वास से बोलना
ko: 🗣️ 자신 있게 말하기
zh: 🗣️ 自信地說話

# goalWritingClearly
source: ✍️ Writing more clearly
de: ✍️ Klar schreiben
es: ✍️ Escribir con claridad
fr: ✍️ Écrire plus clairement
hi: ✍️ स्पष्ट रूप से लिखना
ko: ✍️ 더 명확하게 쓰기
zh: ✍️ 更清楚地寫作

# goalUnderstandingContent
source: 🧩 Understanding content
de: 🧩 Inhalte verstehen
es: 🧩 Entender el contenido
fr: 🧩 Comprendre le contenu
hi: 🧩 सामग्री को समझना
ko: 🧩 내용 이해하기
zh: 🧩 理解內容

# goalReachingLanguageGoals
source: 🎯 Reaching language goals
de: 🎯 Sprachziele erreichen
es: 🎯 Alcanzar metas lingüísticas
fr: 🎯 Atteindre les objectifs linguistiques
hi: 🎯 भाषा के लक्ष्यों को प्राप्त करना
ko: 🎯 언어 목표 달성
zh: 🎯 達成語言目標

source: Weekly Progress
de: Wöchentlicher Fortschritt
es: Progreso Semanal
fr: Progrès Hebdomadaire
hi: साप्ताहिक प्रगति
ko: 주간 진도
zh: 每週進度

# currentStreakSingular
source: Current Streak: {count} day
de: Aktuelle Serie: {count} Tag
es: Racha actual: {count} día
fr: Série actuelle : {count} jour
hi: वर्तमान स्ट्रीक: {count} दिन
ko: 현재 연속 기록: {count}일
zh: 目前連續天數：{count} 天

# currentStreakPlural
source: Current Streak: {count} days
de: Aktuelle Serie: {count} Tage
es: Racha actual: {count} días
fr: Série actuelle : {count} jours
hi: वर्तमान स्ट्रीक: {count} दिन
ko: 현재 연속 기록: {count}일
zh: 目前連續天數：{count} 天

source: Current
de: Aktuell
es: Actual
fr: Actuel
hi: वर्तमान
ko: 현재
zh: 目前

source: Goal
de: Ziel
es: Meta
fr: Objectif
hi: लक्ष्य
ko: 목표
zh: 目標

# daysText
source: {count} days
de: {count} Tage
es: {count} días
fr: {count} jours
hi: {count} दिन
ko: {count}일
zh: {count} 天

# percentToGoal
source: {percent}% to your goal
de: {percent}% Ihres Ziels
es: {percent}% de tu meta
fr: {percent}% de votre objectif
hi: आपके लक्ष्य का {percent}%
ko: 목표까지 {percent}%
zh: 距離目標 {percent}%

# streakMotivationMessage
source: Keep up your streak for better learning results!
de: Halten Sie Ihre Serie aufrecht für bessere Lernergebnisse!
es: ¡Mantén tu racha para mejores resultados de aprendizaje!
fr: Maintenez votre série pour de meilleurs résultats d'apprentissage !
hi: बेहतर सीखने के परिणामों के लिए अपनी स्ट्रीक बनाए रखें!
ko: 더 나은 학습 결과를 위해 연속 기록을 유지하세요!
zh: 保持連續學習以獲得更好的學習成果！

# pointsProgressTitle
source: Points Progress
de: Punktestand
es: Progreso de Puntos
fr: Progrès des Points
hi: अंकों की प्रगति
ko: 포인트 진행률
zh: 積分進度

source: Total Points
de: Gesamtpunkte
es: Puntos Totales
fr: Points Totaux
hi: कुल अंक
ko: 총 포인트
zh: 總積分

# pointsLearningJourney
source: Your Learning Journey
de: Ihre Lernreise
es: Tu Viaje de Aprendizaje
fr: Votre Parcours d'Apprentissage
hi: आपकी सीखने की यात्रा
ko: 학습 여정
zh: 您的學習歷程

# achievementWordExplorer
source: Word Explorer
de: Worterforscher
es: Explorador de Palabras
fr: Explorateur de Mots
hi: शब्द अन्वेषक
ko: 단어 탐험가
zh: 單字探索者

# achievementVocabularyBuilder
source: Vocabulary Builder
de: Vokabelbauer
es: Constructor de Vocabulario
fr: Constructeur de Vocabulaire
hi: शब्दावली निर्माता
ko: 단어 구축자
zh: 單字建構者

# achievementLanguageMaster
source: Language Master
de: Sprachmeister
es: Maestro del Idioma
fr: Maître des Langues
hi: भाषा के मास्टर
ko: 언어 마스터
zh: 語言大師

# pointsFormat
source: {count} pts
de: {count} Punkte
hi: {count} अंक
ko: {count}점
zh: {count} 分

# pointsMotivationMessage
source: Keep earning points to unlock new achievements!
de: Sammeln Sie weiter Punkte, um neue Erfolge freizuschalten!
es: ¡Sigue ganando puntos para desbloquear nuevos logros!
fr: Continuez à gagner des points pour débloquer de nouveaux accomplissements !
hi: नए उपलब्धियों को अनलॉक करने के लिए अंक अर्जित करना जारी रखें!
ko: 새로운 성취를 잠금 해제하기 위해 계속 포인트를 획득하세요!
zh: 繼續賺取積分以解鎖新成就！

# closeButton
source: Close
de: Schließen
es: Cerrar
fr: Fermer
hi: बंद करें
ko: 닫기
zh: 關閉

# chatWithAITitle
source: Chat about "{word}"
de: Chatten Sie über "{word}"
es: Chatea sobre "{word}"
fr: Discutez à propos de "{word}"
hi: "{word}" के बारे में चैट करें
ko: "{word}"에 대해 AI와 채팅
zh: 與 AI 討論「{word}」

# chatWithAIPlaceholder
source: Ask a question about "{word}"...
de: Stellen Sie eine Frage über "{word}"...
es: Haz una pregunta sobre "{word}"...
fr: Posez une question à propos de "{word}"...
hi: "{word}" के बारे में कोई प्रश्न पूछें...
ko: "{word}"에 대해 질문하세요...
zh: 詢問關於「{word}」的問題...

# chatWithAIError
source: Error: {message}
de: Fehler: {message}
fr: Erreur : {message}
hi: त्रुटि: {message}
ko: 오류: {message}
zh: 錯誤：{message}

# practiceButtonText
source: Practice
de: Üben
es: Practicar
fr: Pratiquer
hi: अभ्यास करें
ko: 연습
zh: 練習

# goProButtonText
source: Go Pro
de: Pro werden
es: Hazte Pro
fr: Passez Pro
hi: प्रो बनें
ko: 프로 버전으로 업그레이드
zh: 升級專業版

source: Let's Grow Together! 🌱
de: Lassen Sie uns zusammen wachsen! 🌱
es: ¡Crezcamos Juntos! 🌱
fr: Grandissons Ensemble ! 🌱
hi: आइए साथ बढ़ें! 🌱
ko: 함께 성장해요! 🌱
zh: 讓我們一起成長！🌱

# reviewMotivationText
source: Your feedback helps us create a better learning experience. Share your thoughts and help others discover the joy of learning!
de: Ihr Feedback hilft uns, eine bessere Lernerfahrung zu schaffen. Teilen Sie Ihre Gedanken und helfen Sie anderen, die Freude am Lernen zu entdecken!
es: Tu feedback nos ayuda a crear una mejor experiencia de aprendizaje. ¡Comparte tus pensamientos y ayuda a otros a descubrir la alegría de aprender!
fr: Votre retour nous aide à créer une meilleure expérience d'apprentissage. Partagez vos pensées et aidez les autres à découvrir la joie d'apprendre !
hi: आपकी प्रतिक्रिया हमें एक बेहतर सीखने का अनुभव बनाने में मदद करती है। अपने विचार साझा करें और दूसरों को सीखने की खुशी खोजने में मदद करें!
ko: 귀하의 피드백은 더 나은 학습 경험을 만드는 데 도움이 됩니다. 생각을 공유하고 다른 사람들이 학습의 즐거움을 발견할 수 있도록 도와주세요!
zh: 您的回饋幫助我們創造更好的學習體驗。分享您的想法並幫助其他人發現學習的樂趣！

# letsGrowTogetherButton
source: Let's Grow Together
de: Lassen Sie uns zusammen wachsen
es: Crezcamos Juntos
fr: Grandissons Ensemble
hi: आइए साथ बढ़ें
ko: 함께 성장하기
zh: 讓我們一起成長

# profileTitle
source: Profile
de: Profil
es: Perfil
fr: Profil
hi: प्रोफ़ाइल
ko: 프로필
zh: 個人檔案

source: Favorite Words
de: Lieblingswörter
es: Palabras Favoritas
fr: Mots Favoris
hi: पसंदीदा शब्द
ko: 즐겨찾는 단어
zh: 最愛單字

source: Terms of Service
de: Nutzungsbedingungen
es: Términos de Servicio
fr: Conditions d'Utilisation
hi: सेवा की शर्तें
ko: 서비스 약관
zh: 服務條款

source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de Confidentialité
hi: गोपनीयता नीति
ko: 개인정보 보호정책
zh: 隱私政策

source: Review Us
de: Bewerten Sie uns
es: Reseñanos
fr: Évaluez-nous
hi: हमें रेट करें
ko: 리뷰 작성
zh: 評價我們

source: Contact Support
de: Support kontaktieren
es: Contactar Soporte
fr: Contacter le Support
hi: सहायता से संपर्क करें
ko: 고객 지원 문의
zh: 聯絡客服

source: Onboarding Started
de: Onboarding gestartet
es: Onboarding Iniciado
fr: Onboarding Commencé
hi: ऑनबोर्डिंग शुरू हुई
ko: 온보딩 시작됨
zh: 引導開始

source: Onboarding Completed
de: Onboarding abgeschlossen
es: Onboarding Completado
fr: Onboarding Terminé
hi: ऑनबोर्डिंग पूर्ण हुई
ko: 온보딩 완료됨
zh: 引導完成

# onboardingPageView
source: Onboarding Page View: {pageName}
de: Onboarding-Seitenansicht: {pageName}
es: Vista de Página de Onboarding: {pageName}
fr: Vue de Page d'Onboarding : {pageName}
hi: ऑनबोर्डिंग पेज दृश्य: {pageName}
ko: 온보딩 페이지 조회: {pageName}
zh: 引導頁面檢視：{pageName}

# onboardingProgress
source: Progress: {progress}%
de: Fortschritt: {progress}%
es: Progreso: {progress}%
fr: Progrès : {progress}%
hi: प्रगति: {progress}%
ko: 진행률: {progress}%
zh: 進度：{progress}%

# onboardingSkip
source: Skip
de: Überspringen
es: Saltar
fr: Passer
hi: छोड़ें
ko: 건너뛰기
zh: 跳過

# onboardingBack
source: Back
de: Zurück
es: Atrás
fr: Retour
hi: वापस
ko: 뒤로
zh: 返回

# onboardingStar
source: Star
de: Stern
es: Estrella
fr: Étoile
hi: तारा
ko: 별
zh: 星星

# onboardingNext
source: Next
de: Weiter
es: Siguiente
fr: Suivant
hi: अगला
ko: 다음
zh: 下一個

# onboardingPrevious
source: Previous
de: Zurück
es: Anterior
fr: Précédent
hi: पिछला
ko: 이전
zh: 上一個

# onboardingProgressLabel
source: Progress
de: Fortschritt
es: Progreso
fr: Progrès
hi: प्रगति
ko: 진행률
zh: 進度

# onboardingReviewTitle
source: Love WordStock? ⭐
de: Bereit zum Lernen? Helfen Sie anderen, uns zu finden! 🌱
es: ¿Listo para aprender? ¡Ayuda a otros a encontrarnos! 🌱
fr: Prêt à apprendre ? Aidez les autres à nous trouver ! 🌱
hi: सीखने के लिए तैयार? दूसरों को हमें खोजने में मदद करें! 🌱
ko: 학습 준비 완료? 다른 분들이 저희를 찾도록 도와주세요! 🌱
zh: 準備好學習了嗎？幫助其他人找到我們！🌱

# onboardingReviewSubtitle
source: Your review helps us reach more word lovers and improve our app. It takes just a moment!
de: Wir wissen, dass Sie gerade erst Ihre WordStock-Reise beginnen, aber Ihre frühe Unterstützung hilft anderen Sprachlernenden, unsere App zu entdecken. Gemeinsam können wir eine Gemeinschaft von Wort-Enthusiasten aufbauen!
es: Sabemos que apenas estás comenzando tu viaje con WordStock, pero tu apoyo temprano ayuda a otros estudiantes de idiomas a descubrir nuestra app. ¡Juntos podemos construir una comunidad de entusiastas de las palabras!
fr: Nous savons que vous commencez tout juste votre voyage WordStock, mais votre soutien précoce aide d'autres apprenants de langues à découvrir notre application. Ensemble, nous pouvons construire une communauté de passionnés de mots !
hi: हम जानते हैं कि आप अभी-अभी अपनी WordStock यात्रा शुरू कर रहे हैं, लेकिन आपका प्रारंभिक समर्थन अन्य भाषा सीखने वालों को हमारा ऐप खोजने में मदद करता है। आइए मिलकर शब्द प्रेमियों का एक समुदाय बनाते हैं!
ko: WordStock 여정을 이제 막 시작하신다는 것을 알고 있지만, 초기 지원이 다른 언어 학습자들이 저희 앱을 발견하는 데 도움이 됩니다. 함께 단어 애호가들의 커뮤니티를 만들어요!
zh: 我們知道您剛開始 WordStock 的學習旅程，但您的早期支持能幫助其他語言學習者發現我們的應用程式。讓我們一起建立單字愛好者的社群！

# onboardingReviewButton
source: ⭐ Rate WordStock
de: 🌱 Beim Wachsen helfen
es: 🌱 Ayúdanos a crecer
fr: 🌱 Aidez-nous à grandir
hi: 🌱 हमारी वृद्धि में मदद करें
ko: 🌱 성장 도움 주기
zh: 🌱 幫助我們成長

# onboardingReviewSkip
source: Maybe Later
de: Lassen Sie mich es zuerst ausprobieren
es: Déjame probarlo primero
fr: Laissez-moi d'abord l'essayer
hi: मुझे पहले इसे आजमाने दें
ko: 먼저 사용해보고 결정할게요
zh: 讓我先試用看看

# onboardingEnglishTestTitle
source: Quick English Assessment 📝
de: Schnelle Englisch-Bewertung 📝
es: Evaluación Rápida de Inglés 📝
fr: Évaluation Rapide d'Anglais 📝
hi: त्वरित अंग्रेजी मूल्यांकन 📝
ko: 빠른 영어 평가 📝
zh: 快速英語評估 📝

# onboardingEnglishTestSubtitle
source: Let's gauge your vocabulary level with a quick 10-question test. This helps us personalize your learning experience!
de: Lassen Sie uns Ihr Vokabularniveau mit einem schnellen 10-Fragen-Test einschätzen. Das hilft uns, Ihre Lernerfahrung zu personalisieren!
es: Midamos tu nivel de vocabulario con una prueba rápida de 5 preguntas. ¡Esto nos ayuda a personalizar tu experiencia de aprendizaje!
fr: Évaluons votre niveau de vocabulaire avec un test rapide de 10 questions. Cela nous aide à personnaliser votre expérience d'apprentissage !
hi: आइए 10-प्रश्न परीक्षा के साथ आपके शब्दावली स्तर का आकलन करते हैं। यह हमें आपके सीखने के अनुभव को व्यक्तिगत बनाने में मदद करता है!
ko: 10문제의 빠른 테스트로 어휘 수준을 측정해 보겠습니다. 이를 통해 학습 경험을 개인화할 수 있습니다!
zh: 讓我們透過 5 道快速測驗來評估您的單字程度。這有助於我們個人化您的學習體驗！

# onboardingEnglishTestStart
source: 🚀 Start Assessment
de: 🚀 Bewertung starten
es: 🚀 Comenzar Evaluación
fr: 🚀 Commencer l'Évaluation
hi: 🚀 मूल्यांकन शुरू करें
ko: 🚀 평가 시작
zh: 🚀 開始評估

# onboardingEnglishTestSkip
source: Skip for Now
de: Für jetzt überspringen
es: Omitir por Ahora
fr: Ignorer pour l'instant
hi: अभी के लिए छोड़ें
ko: 지금은 건너뛰기
zh: 暫時跳過

# onboardingEnglishTestIcon
source: English Test
de: Englisch-Test
es: Prueba de Inglés
fr: Test d'Anglais
hi: अंग्रेजी परीक्षा
ko: 영어 테스트
zh: 英語測驗

# onboardingEnglishTestExcellent
source: Excellent! 🌟
de: Ausgezeichnet! 🌟
es: ¡Excelente! 🌟
hi: उत्कृष्ट! 🌟
ko: 훌륭해요! 🌟
zh: 優秀！🌟

# onboardingEnglishTestGood
source: Great Job! 👍
de: Großartige Arbeit! 👍
es: ¡Gran Trabajo! 👍
fr: Excellent Travail ! 👍
hi: शानदार काम! 👍
ko: 잘하셨어요! 👍
zh: 做得很好！👍

# onboardingEnglishTestOkay
source: Good Start! 💡
de: Guter Start! 💡
es: ¡Buen Comienzo! 💡
fr: Bon Début ! 💡
hi: अच्छी शुरुआत! 💡
ko: 좋은 시작이에요! 💡
zh: 良好的開始！💡

# onboardingEnglishTestScore
source: You scored {correct} out of {total}
de: Sie haben {correct} von {total} erreicht
es: Obtuviste {correct} de {total}
fr: Vous avez obtenu {correct} sur {total}
hi: आपने {correct} में से {total} अंक प्राप्त किए
ko: {total}문제 중 {correct}문제를 맞히셨습니다
zh: 您在 {total} 題中得到 {correct} 分

# settingsTitle
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
ko: 설정
zh: 設定

# settingsNotifications
source: Notifications
de: Benachrichtigungen
es: Notificaciones
hi: सूचनाएं
ko: 알림
zh: 通知

# settingsNotificationsDescription
source: Control when and how you receive notifications
de: Steuern Sie wann und wie Sie Benachrichtigungen erhalten
es: Controla cuándo y cómo recibir notificaciones
fr: Contrôlez quand et comment recevoir les notifications
hi: नियंत्रित करें कि आपको कब और कैसे सूचनाएं प्राप्त हों
ko: 알림을 언제 어떻게 받을지 제어하세요
zh: 控制接收通知的時間和方式

# settingsEnableNotifications
source: Enable Notifications
de: Benachrichtigungen aktivieren
es: Activar notificaciones
fr: Activer les notifications
hi: सूचनाएं सक्षम करें
ko: 알림 활성화
zh: 啟用通知

# settingsEnableNotificationsDescription
source: Turn all notifications on or off
de: Alle Benachrichtigungen ein- oder ausschalten
es: Activar o desactivar todas las notificaciones
fr: Activer ou désactiver toutes les notifications
hi: सभी सूचनाओं को चालू या बंद करें
ko: 모든 알림을 켜거나 끄기
zh: 開啟或關閉所有通知

# settingsDailyReminders
source: Daily Reminders
de: Tägliche Erinnerungen
es: Recordatorios diarios
fr: Rappels quotidiens
hi: दैनिक रिमाइंडर
ko: 일일 알림
zh: 每日提醒

# settingsDailyRemindersDescription
source: Get reminded to practice daily
de: Lassen Sie sich täglich ans Üben erinnern
es: Recibe recordatorios para practicar diariamente
fr: Recevez des rappels pour pratiquer quotidiennement
hi: रोज़ाना अभ्यास के लिए रिमाइंडर प्राप्त करें
ko: 매일 연습하라는 알림 받기
zh: 提醒您每日練習

# settingsPracticeReminders
source: Practice Reminders
de: Übungserinnerungen
es: Recordatorios de práctica
fr: Rappels de pratique
hi: अभ्यास रिमाइंडर
ko: 연습 알림
zh: 練習提醒

# settingsPracticeRemindersDescription
source: Get reminded when you haven't practiced
de: Lassen Sie sich erinnern, wenn Sie nicht geübt haben
es: Recibe recordatorios cuando no hayas practicado
fr: Recevez des rappels quand vous n'avez pas pratiqué
hi: जब आपने अभ्यास नहीं किया हो तो रिमाइंडर पाएं
ko: 연습하지 않았을 때 알림 받기
zh: 在您沒有練習時提醒您

# settingsNewWords
source: New Words
de: Neue Wörter
es: Nuevas palabras
fr: Nouveaux mots
hi: नए शब्द
ko: 새로운 단어
zh: 新單字

# settingsNewWordsDescription
source: Get notified about new vocabulary
de: Benachrichtigungen über neue Vokabeln erhalten
es: Recibe notificaciones sobre nuevo vocabulario
fr: Recevez des notifications sur le nouveau vocabulaire
hi: नई शब्दावली के बारे में सूचनाएं प्राप्त करें
ko: 새로운 어휘에 대한 알림 받기
zh: 收到新單字的通知

# settingsStreakReminders
source: Streak Reminders
de: Streak-Erinnerungen
es: Recordatorios de racha
fr: Rappels de série
hi: स्ट्रीक रिमाइंडर
ko: 연속 기록 알림
zh: 連續學習提醒

# settingsStreakRemindersDescription
source: Don't break your learning streak
de: Brechen Sie nicht Ihre Lernstreak
es: No rompas tu racha de aprendizaje
fr: Ne cassez pas votre série d'apprentissage
hi: अपना सीखने का स्ट्रीक न तोड़ें
ko: 학습 연속 기록을 놓치지 마세요
zh: 不要中斷您的學習連續紀錄

# settingsResetToDefaults
source: Reset to Defaults
de: Auf Standardwerte zurücksetzen
es: Restablecer valores por defecto
fr: Réinitialiser aux valeurs par défaut
hi: डिफ़ॉल्ट पर रीसेट करें
ko: 기본값으로 재설정
zh: 重設為預設值

# settingsResetTitle
source: Reset Settings
de: Einstellungen zurücksetzen
es: Restablecer configuración
fr: Réinitialiser les paramètres
hi: सेटिंग्स रीसेट करें
ko: 설정 재설정
zh: 重設設定

# settingsResetMessage
source: Are you sure you want to reset all settings to their default values? This action cannot be undone.
de: Sind Sie sicher, dass Sie alle Einstellungen auf ihre Standardwerte zurücksetzen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres restablecer toda la configuración a sus valores por defecto? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir réinitialiser tous les paramètres à leurs valeurs par défaut ? Cette action ne peut pas être annulée.
hi: क्या आप वाकई सभी सेटिंग्स को उनके डिफ़ॉल्ट मानों पर रीसेट करना चाहते हैं? इस कार्य को पूर्ववत नहीं किया जा सकता।
ko: 모든 설정을 기본값으로 재설정하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh: 您確定要將所有設定重設為預設值嗎？此操作無法復原。

# settingsLoadingMessage
source: Loading settings...
de: Einstellungen werden geladen...
es: Cargando configuración...
fr: Chargement des paramètres...
hi: सेटिंग्स लोड हो रही हैं...
ko: 설정 로딩 중...
zh: 載入設定中...

source: Settings Error
de: Einstellungsfehler
es: Error de configuración
fr: Erreur de paramètres
hi: सेटिंग्स त्रुटि
ko: 설정 오류
zh: 設定錯誤

# settingsRetry
source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
ko: 다시 시도
zh: 重試

# settingsRecover
source: Recover
de: Wiederherstellen
es: Recuperar
fr: Récupérer
hi: पुनर्प्राप्त करें
ko: 복구
zh: 恢復

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
ko: 취소
zh: 取消

source: Reset
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
hi: रीसेट करें
ko: 재설정
zh: 重設

# vocabularyLevelUpdated
source: Vocabulary level updated to {levelName}
de: Wortschatz-Level wurde auf {levelName} aktualisiert
es: Nivel de vocabulario actualizado a {levelName}
fr: Niveau de vocabulaire mis à jour vers {levelName}
hi: शब्दावली स्तर को {levelName} में अपडेट किया गया
ko: 어휘 수준이 {levelName}(으)로 업데이트되었습니다
zh: 單字程度已更新為 {levelName}

source: Something went wrong
de: Etwas ist schief gelaufen
es: Algo salió mal
fr: Quelque chose s'est mal passé
hi: कुछ गलत हुआ
ko: 문제가 발생했습니다
zh: 發生錯誤

source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
ko: 다시 시도
zh: 重試

source: Quick Actions
de: Schnelle Aktionen
es: Acciones rápidas
fr: Actions rapides
hi: त्वरित कार्य
ko: 빠른 작업
zh: 快速操作

source: Vocabulary Level
de: Wortschatz-Level
es: Nivel de vocabulario
fr: Niveau de vocabulaire
hi: शब्दावली स्तर
ko: 어휘 수준
zh: 單字程度

# supportAndInfo
source: Support & Info
es: Soporte e información
fr: Support et informations
hi: सहायता और जानकारी
ko: 지원 및 정보
zh: 支援與資訊

source: Copy User ID
de: Benutzer-ID kopieren
es: Copiar ID de usuario
fr: Copier l'ID utilisateur
hi: उपयोगकर्ता ID कॉपी करें
ko: 사용자 ID 복사
zh: 複製使用者 ID

# userIDCopied
source: User ID copied to clipboard
de: Benutzer-ID in die Zwischenablage kopiert
es: ID de usuario copiado al portapapeles
fr: ID utilisateur copié dans le presse-papiers
hi: उपयोगकर्ता ID क्लिपबोर्ड पर कॉपी की गई
ko: 사용자 ID가 클립보드에 복사되었습니다
zh: 使用者 ID 已複製到剪貼簿

source: Legal
de: Rechtliches
fr: Légal
hi: कानूनी
ko: 법적 고지
zh: 法律條款

# vocabularyLevelDialogTitle
source: What is your Vocabulary Level?
de: Was ist dein Wortschatz-Level?
es: ¿Cuál es tu nivel de vocabulario?
fr: Quel est votre niveau de vocabulaire ?
hi: आपका शब्दावली स्तर क्या है?
ko: 어휘 수준이 어떻게 되시나요?
zh: 您的單字程度是什麼？

# vocabularyLevelDialogDescription
source: Select the level that best describes your current vocabulary.
de: Wähle das Level, das deinen aktuellen Wortschatz am besten beschreibt.
es: Selecciona el nivel que mejor describa tu vocabulario actual.
fr: Sélectionnez le niveau qui décrit le mieux votre vocabulaire actuel.
hi: वह स्तर चुनें जो आपकी वर्तमान शब्दावली का सबसे अच्छा वर्णन करता है।
ko: 현재 어휘 수준을 가장 잘 설명하는 레벨을 선택하세요.
zh: 選擇最符合您目前單字程度的選項。

# saveButton
source: Save
de: Speichern
es: Guardar
fr: Enregistrer
hi: सेव करें
ko: 저장
zh: 儲存
