Repository: adilsakout/wordstock
Catalog: lib/l10n/arb/app_*.arb
Languages: de, es, fr, hi, ko, zh

# welcomeTitle
source: Welcome to Wordstock
de: Willkommen bei Wordstock
es: Bienvenido a Wordstock
fr: Bienvenue sur Wordstock
hi: वर्डस्टॉक में आपका स्वागत है
ko: Wordstock에 오신 것을 환영합니다
zh: 歡迎使用 Wordstock

# welcomeDescription
source: Wordstock is a tool that helps you learn new words.
de: Wordstock ist ein Tool, das Ihnen hilft, neue Wörter zu lernen.
es: Wordstock es una herramienta que te ayuda a aprender nuevas palabras.
fr: Wordstock est un outil qui vous aide à apprendre de nouveaux mots.
hi: वर्डस्टॉक एक ऐसा टूल है जो आपको नए शब्द सीखने में मदद करता है।
ko: Wordstock은 새로운 단어를 학습하는 데 도움을 주는 도구입니다.
zh: Wordstock 是一個幫助您學習新單字的工具。

# infoTitle
source: Create a custom word list
de: Erstellen Sie Ihre eigene Wortliste
es: Crea una lista personalizada de palabras
fr: Créez une liste personnalisée de mots
hi: अपनी खुद की शब्द सूची बनाएं
ko: 맞춤 단어 목록 만들기
zh: 建立自訂單字清單

# infoDescription
source: Wordstock is a tool that helps you learn new words.
de: Wordstock ist ein Tool, das Ihnen hilft, neue Wörter zu lernen.
es: Wordstock es una herramienta que te ayuda a aprender nuevas palabras.
fr: Wordstock est un outil qui vous aide à apprendre de nouveaux mots.
hi: वर्डस्टॉक एक ऐसा टूल है जो आपको नए शब्द सीखने में मदद करता है।
ko: Wordstock은 새로운 단어를 학습하는 데 도움을 주는 도구입니다.
zh: Wordstock 是一個幫助您學習新單字的工具。

source: Get Started
de: Loslegen
es: Comenzar
fr: Commencer
hi: शुरू करें
ko: 시작하기
zh: 開始使用

# continueText
source: Continue
de: Weiter
es: Continuar
fr: Continuer
hi: जारी रखें
ko: 계속
zh: 繼續

# makeYoursTitle
source: Let's make WordStock yours
de: Machen Sie Wordstock zu Ihrem eigenen
es: Hagamos WordStock tuyo
fr: Personnalisons WordStock pour vous
hi: वर्डस्टॉक को अपना बनाएं
ko: WordStock을 개인화해 보세요
zh: 讓我們個人化您的 WordStock

# makeYoursWithNameTitle
source: Let's make WordStock yours, {name}
de: Machen Sie Wordstock zu Ihrem eigenen, {name}
es: Hagamos WordStock tuyo, {name}
fr: Personnalisons WordStock pour vous, {name}
hi: वर्डस्टॉक को अपना बनाएं, {name}
ko: WordStock을 개인화해 보세요, {name}님
zh: 讓我們個人化您的 WordStock，{name}

# personalizeDescription
source: Some final questions to help us personalize your experience.
de: Einige letzte Fragen, um Ihre Erfahrung zu personalisieren.
es: Algunas preguntas finales para ayudarnos a personalizar tu experiencia.
fr: Quelques questions finales pour nous aider à personnaliser votre expérience.
hi: आपके अनुभव को व्यक्तिगत बनाने के लिए कुछ अंतिम प्रश्न।
ko: 학습 경험을 개인화하기 위한 마지막 몇 가지 질문입니다.
zh: 最後幾個問題，幫助我們個人化您的學習體驗。

# favoriteWordsTitle
source: Your Favorite Words
de: Ihre Lieblingswörter
es: Tus Palabras Favoritas
fr: Vos Mots Favoris
hi: आपके पसंदीदा शब्द
ko: 즐겨찾는 단어
zh: 您的最愛單字

source: Try Again
de: Erneut versuchen
es: Intentar de nuevo
fr: Réessayer
hi: पुनः प्रयास करें
ko: 다시 시도
zh: 重試

# noFavoritesTitle
source: No favorite words yet
de: Noch keine Lieblingswörter
es: Aún no hay palabras favoritas
fr: Pas encore de mots favoris
hi: अभी तक कोई पसंदीदा शब्द नहीं हैं
ko: 아직 즐겨찾는 단어가 없습니다
zh: 尚無最愛單字

# noFavoritesDescription
source: Start adding words to your favorites
de: Beginnen Sie, Wörter zu Ihren Favoriten hinzuzufügen
es: Comienza a agregar palabras a tus favoritas
fr: Commencez à ajouter des mots à vos favoris
hi: अपने पसंदीदा शब्दों को जोड़ना शुरू करें
ko: 단어를 즐겨찾기에 추가해 보세요
zh: 開始將單字加入您的最愛

# timeCommitmentTitle
source: How much time will you devote to learning?
de: Wie viel Zeit möchten Sie dem Lernen widmen?
es: ¿Cuánto tiempo dedicarás al aprendizaje?
fr: Combien de temps allez-vous consacrer à l'apprentissage ?
hi: आप सीखने के लिए कितना समय देंगे?
ko: 하루에 얼마나 많은 시간을 학습에 투자하실 건가요?
zh: 您每天會花多少時間學習？

# timeCommitmentDescription
source: Choose the amount of time you can commit to learning each day.
de: Wählen Sie, wie viel Zeit Sie täglich zum Lernen aufwenden können.
es: Elige la cantidad de tiempo que puedes dedicar al aprendizaje cada día.
fr: Choisissez le temps que vous pouvez consacrer à l'apprentissage chaque jour.
hi: प्रतिदिन सीखने के लिए आप कितना समय दे सकते हैं, चुनें।
ko: 매일 학습에 투자할 수 있는 시간을 선택하세요.
zh: 選擇您每天可以投入學習的時間。

# fiveMinutes
source: ⚡️ 5 minutes a day
de: ⚡️ 5 Minuten täglich
es: ⚡️ 5 minutos al día
fr: ⚡️ 5 minutes par jour
hi: ⚡️ प्रतिदिन 5 मिनट
ko: ⚡️ 하루 5분
zh: ⚡️ 每天 5 分鐘

# tenMinutes
source: ⏱️ 10 minutes a day
de: ⏱️ 10 Minuten täglich
es: ⏱️ 10 minutos al día
fr: ⏱️ 10 minutes par jour
hi: ⏱️ प्रतिदिन 10 मिनट
ko: ⏱️ 하루 10분
zh: ⏱️ 每天 10 分鐘

# fifteenMinutes
source: ⏳ 15 minutes a day
de: ⏳ 15 Minuten täglich
es: ⏳ 15 minutos al día
fr: ⏳ 15 minutes par jour
hi: ⏳ प्रतिदिन 15 मिनट
ko: ⏳ 하루 15분
zh: ⏳ 每天 15 分鐘

# thirtyMinutes
source: 🕰️ 30 minutes a day
de: 🕰️ 30 Minuten täglich
es: 🕰️ 30 minutos al día
fr: 🕰️ 30 minutes par jour
hi: 🕰️ प्रतिदिन 30 मिनट
ko: 🕰️ 하루 30분
zh: 🕰️ 每天 30 分鐘

# topicSelectionTitle
source: Which topics are you interested in?
de: Welche Themen interessieren Sie?
es: ¿Qué temas te interesan?
fr: Quels sujets vous intéressent ?
hi: आपको कौन से विषय रुचिकर लगते हैं?
ko: 어떤 주제에 관심이 있으신가요?
zh: 您對哪些主題感興趣？

# topicSelectionDescription
source: Select the topics that you are most interested in learning about.
de: Wählen Sie die Themen, die Sie am meisten interessieren.
es: Selecciona los temas que más te interesan aprender.
fr: Sélectionnez les sujets qui vous intéressent le plus.
hi: वे विषय चुनें जो आपको सबसे अधिक रुचिकर लगते हैं।
ko: 가장 관심 있는 학습 주제를 선택하세요.
zh: 選擇您最感興趣的學習主題。

# topicSociety
source: 👥 Society
de: 👥 Gesellschaft
es: 👥 Sociedad
fr: 👥 Société
hi: 👥 समाज
ko: 👥 사회
zh: 👥 社會

# topicForeignLanguages
source: 🌏 Foreign languages
de: 🌏 Fremdsprachen
es: 🌏 Idiomas extranjeros
fr: 🌏 Langues étrangères
hi: 🌏 विदेशी भाषाएं
ko: 🌏 외국어
zh: 🌏 外語

# topicHumanBody
source: 💪 Human body
de: 💪 Menschlicher Körper
es: 💪 Cuerpo humano
fr: 💪 Corps humain
hi: 💪 मानव शरीर
ko: 💪 인체
zh: 💪 人體

# topicEmotions
source: 😃 Emotions
de: 😃 Emotionen
es: 😃 Emociones
fr: 😃 Émotions
hi: 😃 भावनाएं
ko: 😃 감정
zh: 😃 情感

# topicOther
source: 🔍 Other
de: 🔍 Andere
es: 🔍 Otros
fr: 🔍 Autres
hi: 🔍 अन्य
ko: 🔍 기타
zh: 🔍 其他

# customizationLoadingTitleWithName
source: Hang tight, {name}! We are personalizing your Wordstock experience.
de: Einen Moment, {name}! Wir personalisieren Ihre Wordstock-Erfahrung.
es: ¡Espera un momento, {name}! Estamos personalizando tu experiencia Wordstock.
fr: Un instant, {name} ! Nous personnalisons votre expérience Wordstock.
hi: एक पल, {name}! हम आपका वर्डस्टॉक अनुभव व्यक्तिगत बना रहे हैं।
ko: 잠시만 기다려 주세요, {name}님! Wordstock 경험을 개인화하고 있습니다.
zh: 請稍等，{name}！我們正在個人化您的 Wordstock 體驗。

# customizationLoadingTitle
source: Hang tight! We are personalizing your Wordstock experience.
de: Einen Moment! Wir personalisieren Ihre Wordstock-Erfahrung.
es: ¡Espera un momento! Estamos personalizando tu experiencia Wordstock.
fr: Un instant ! Nous personnalisons votre expérience Wordstock.
hi: एक पल! हम आपका वर्डस्टॉक अनुभव व्यक्तिगत बना रहे हैं।
ko: 잠시만 기다려 주세요! Wordstock 경험을 개인화하고 있습니다.
zh: 請稍等！我們正在個人化您的 Wordstock 體驗。

# customizationCompleteTitleWithName
source: All set, {name}! Your Wordstock experience is ready!
de: Fertig, {name}! Ihre Wordstock-Erfahrung ist bereit.
es: ¡Listo, {name}! Tu experiencia Wordstock está preparada.
fr: Voilà, {name} ! Votre expérience Wordstock est prête.
hi: तैयार है, {name}! आपका वर्डस्टॉक अनुभव तैयार है।
ko: 완료되었습니다, {name}님! Wordstock 경험이 준비되었습니다!
zh: 完成了，{name}！您的 Wordstock 體驗已準備就緒！

# customizationCompleteTitle
source: All set! Your Wordstock experience is ready!
de: Fertig! Ihre Wordstock-Erfahrung ist bereit.
es: ¡Listo! Tu experiencia Wordstock está preparada.
fr: Voilà ! Votre expérience Wordstock est prête.
hi: तैयार है! आपका वर्डस्टॉक अनुभव तैयार है।
ko: 완료되었습니다! Wordstock 경험이 준비되었습니다!
zh: 完成了！您的 Wordstock 體驗已準備就緒！

# craftingExperienceTitle
source: We are crafting your
de: Wir erstellen Ihre
es: Estamos creando tu
fr: Nous créons votre
hi: हम बना रहे हैं आपका
ko: 귀하의
zh: 我們正在為您打造

# learningExperienceSubtitle
source: Learning experience...
de: Lernerfahrung...
es: Experiencia de aprendizaje...
fr: Expérience d'apprentissage...
hi: सीखने का अनुभव...
ko: 학습 경험을 만들고 있습니다...
zh: 學習體驗...

# profileSetupTitle
source: Setting up your profile
de: Einrichtung Ihres Profils
es: Configurando tu perfil
fr: Configuration de votre profil
hi: आपकी प्रोफ़ाइल सेटअप
ko: 프로필 설정 중
zh: 設定您的個人檔案

# forgetWordsQuestion
source: Do you often forget new words even after reviewing them several times?
de: Vergessen Sie oft neue Wörter, auch nachdem Sie sie mehrmals wiederholt haben?
es: ¿A menudo olvidas palabras nuevas incluso después de repasarlas varias veces?
fr: Oubliez-vous souvent de nouveaux mots même après les avoir revus plusieurs fois ?
hi: क्या आप अक्सर नए शब्दों को कई बार दोहराने के बाद भी भूल जाते हैं?
ko: 여러 번 복습해도 새로운 단어를 자주 잊어버리시나요?
zh: 您是否經常在複習數次後仍忘記新單字？

# learningPreferencesTitle
source: Adjusting your learning preferences
de: Anpassung Ihrer Lernpräferenzen
es: Ajustando tus preferencias de aprendizaje
fr: Ajustement de vos préférences d'apprentissage
hi: आपकी सीखने की प्राथमिकताएं समायोजित करना
ko: 학습 선호도 조정 중
zh: 調整您的學習偏好

# readingConversationQuestion
source: Do you feel frustrated when you understand a word while reading, but can't use it in conversation?
de: Fühlen Sie sich frustriert, wenn Sie ein Wort beim Lesen verstehen, es aber nicht in der Konversation verwenden können?
es: ¿Te sientes frustrado cuando entiendes una palabra al leer, pero no puedes usarla en conversación?
fr: Vous sentez-vous frustré lorsque vous comprenez un mot en lecture mais ne pouvez pas l'utiliser en conversation ?
hi: क्या आप निराश होते हैं जब आप पढ़ते समय एक शब्द समझ लेते हैं लेकिन बातचीत में उसका उपयोग नहीं कर पाते?
ko: 읽을 때는 단어를 이해하지만 대화에서는 사용할 수 없을 때 좌절감을 느끼시나요?
zh: 您是否在閱讀時理解某個單字，但在對話中卻無法使用時感到沮喪？

# growthAreasTitle
source: Analyzing your growth areas
de: Analyse Ihrer Wachstumsbereiche
es: Analizando tus áreas de crecimiento
fr: Analyse de vos domaines de croissance
hi: आपके विकास के क्षेत्रों का विश्लेषण
ko: 성장 영역 분석 중
zh: 分析您的成長領域

# progressFrustrationQuestion
source: Are you putting in the effort but still feel like you're not making fast progress?
de: Machen Sie Fortschritte, haben aber das Gefühl, nicht schnell genug voranzukommen?
es: ¿Estás poniendo esfuerzo pero aún sientes que no progresas rápidamente?
fr: Faites-vous des efforts mais avez l'impression de ne pas progresser rapidement ?
hi: क्या आप प्रयास कर रहे हैं लेकिन फिर भी तेजी से प्रगति नहीं कर पा रहे हैं?
ko: 노력하고 있지만 여전히 충분히 빠른 진전을 보이지 못한다고 느끼시나요?
zh: 您是否努力學習但仍覺得進步不夠快？

# buttonYes
source: Yes
de: Ja
es: Sí
fr: Oui
hi: हाँ
ko: 예
zh: 是

# buttonNo
source: No
de: Nein
fr: Non
hi: नहीं
ko: 아니오
zh: 否

source: To move forward, specify
de: Um fortzufahren, geben Sie an
es: Para continuar, especifica
fr: Pour continuer, spécifiez
hi: आगे बढ़ने के लिए, निर्दिष्ट करें
ko: 계속하려면 지정해 주세요
zh: 要繼續，請指定

source: Start Learning
de: Lernen beginnen
es: Comenzar a Aprender
fr: Commencer à Apprendre
hi: सीखना शुरू करें
ko: 학습 시작
zh: 開始學習

# analyzingPreferences
source: Analyzing your preferences...
de: Analyse Ihrer Präferenzen...
es: Analizando tus preferencias...
fr: Analyse de vos préférences...
hi: आपकी प्राथमिकताओं का विश्लेषण...
ko: 선호도 분석 중...
zh: 分析您的偏好...

# selectingWords
source: Selecting words based on your level...
de: Auswahl von Wörtern nach Ihrem Niveau...
es: Seleccionando palabras según tu nivel...
fr: Sélection des mots selon votre niveau...
hi: आपके स्तर के अनुसार शब्दों का चयन...
ko: 레벨에 따른 단어 선택 중...
zh: 根據您的程度選擇單字...

# personalizingPath
source: Personalizing your learning path...
de: Personalisierung Ihres Lernwegs...
es: Personalizando tu camino de aprendizaje...
fr: Personnalisation de votre parcours d'apprentissage...
hi: आपके सीखने के मार्ग को व्यक्तिगत बनाना...
ko: 학습 경로 개인화 중...
zh: 個人化您的學習路徑...

# creatingWordList
source: Creating your custom word list...
de: Erstellung Ihrer persönlichen Wortliste...
es: Creando tu lista personalizada de palabras...
fr: Création de votre liste personnalisée de mots...
hi: आपकी व्यक्तिगत शब्द सूची बनाना...
ko: 맞춤 단어 목록 생성 중...
zh: 建立您的自訂單字清單...

# finalizingExperience
source: Finalizing your experience...
de: Fertigstellung Ihrer Erfahrung...
es: Finalizando tu experiencia...
fr: Finalisation de votre expérience...
hi: आपके अनुभव को अंतिम रूप देना...
ko: 경험 마무리 중...
zh: 完成您的體驗...

# practiceReminderTitle
source: Great progress!
de: Ausgezeichneter Fortschritt!
es: ¡Excelente progreso!
fr: Excellent progrès !
hi: उत्कृष्ट प्रगति!
ko: 훌륭한 진전이에요!
zh: 很棒的進步！

# practiceReminderDescription
source: You've learned {count} new words! Now is a perfect time to practice and reinforce your learning.
de: Sie haben {count} neue Wörter gelernt! Es ist der perfekte Zeitpunkt, um zu üben und Ihr Lernen zu festigen.
es: ¡Has aprendido {count} palabras nuevas! Ahora es el momento perfecto para practicar y reforzar tu aprendizaje.
fr: Vous avez appris {count} nouveaux mots ! C'est le moment idéal pour pratiquer et renforcer votre apprentissage.
hi: आपने {count} नए शब्द सीखे हैं! अभ्यास करने और अपने सीखने को मजबूत करने का यह सही समय है।
ko: {count}개의 새로운 단어를 배우셨어요! 지금이 연습하고 학습을 강화할 완벽한 시간입니다.
zh: 您已學會 {count} 個新單字！現在是練習和鞏固學習的絕佳時機。

source: Start Practice
de: Übung beginnen
es: Comenzar Práctica
fr: Commencer la Pratique
hi: अभ्यास शुरू करें
ko: 연습 시작
zh: 開始練習

source: Continue Learning
de: Weiterlernen
es: Continuar Aprendiendo
fr: Continuer l'Apprentissage
hi: सीखना जारी रखें
ko: 학습 계속하기
zh: 繼續學習

# streakMilestoneTitle
source: Streak Milestone!
de: Lernserie erreicht!
es: ¡Hito de Racha!
fr: Objectif de Série Atteint !
hi: लगातार सीखने का लक्ष्य पूरा!
ko: 연속 학습 기록!
zh: 連續學習里程碑！

# streakDaysCount
source: {count} days
de: {count} Tage
es: {count} días
fr: {count} jours
hi: {count} दिन
ko: {count}일
zh: {count} 天

# streakCongratulationsMessage
source: Congratulations! You've been learning consistently for {count} days. Keep up the great work!
de: Glückwunsch! Sie lernen seit {count} Tagen kontinuierlich. Machen Sie so weiter!
es: ¡Felicidades! Has estado aprendiendo consistentemente por {count} días. ¡Sigue así!
fr: Félicitations ! Vous apprenez de manière constante depuis {count} jours. Continuez ainsi !
hi: बधाई हो! आप {count} दिनों से लगातार सीख रहे हैं। इसी तरह जारी रखें!
ko: 축하합니다! {count}일 동안 꾸준히 학습하셨습니다. 계속 잘하고 계세요!
zh: 恭喜！您已連續學習 {count} 天。繼續保持！

# streakCongratulationsMessageSingular
source: Congratulations! You've started your learning journey today. Keep it up!
de: Glückwunsch! Sie haben heute Ihre Lernreise begonnen. Machen Sie so weiter!
es: ¡Felicidades! Has comenzado tu viaje de aprendizaje hoy. ¡Sigue así!
fr: Félicitations ! Vous avez commencé votre parcours d'apprentissage aujourd'hui. Continuez ainsi !
hi: बधाई हो! आपने आज अपना सीखने का सफर शुरू किया है। इसी तरह जारी रखें!
ko: 축하합니다! 오늘 학습 여정을 시작하셨네요. 계속 하세요!
zh: 恭喜！您今天開始了學習之旅。繼續加油！

# streakCongratulationsMessagePlural
source: Congratulations! You've been learning consistently for {count} days. Keep up the great work!
de: Glückwunsch! Sie lernen seit {count} Tagen kontinuierlich. Machen Sie so weiter!
es: ¡Felicidades! Has estado aprendiendo consistentemente por {count} días. ¡Sigue así!
fr: Félicitations ! Vous apprenez de manière constante depuis {count} jours. Continuez ainsi !
hi: बधाई हो! आप {count} दिनों से लगातार सीख रहे हैं। इसी तरह जारी रखें!
ko: 축하합니다! {count}일 동안 꾸준히 학습하셨습니다. 계속 잘하고 계세요!
zh: 恭喜！您已連續學習 {count} 天。繼續保持！

source: Keep Going!
de: Weiter so!
es: ¡Sigue Adelante!
fr: Continuez !
hi: जारी रखें!
ko: 계속 하세요!
zh: 繼續加油！

# streakCongratulationsSingular
source: Congratulations! You've started your learning journey today. Keep it up!
de: Glückwunsch! Sie haben heute Ihre Lernreise begonnen. Machen Sie so weiter!
es: ¡Felicidades! Has comenzado tu viaje de aprendizaje hoy. ¡Sigue así!
fr: Félicitations ! Vous avez commencé votre parcours d'apprentissage aujourd'hui. Continuez ainsi !
hi: बधाई हो! आपने आज अपना सीखने का सफर शुरू किया है। इसी तरह जारी रखें!
ko: 축하합니다! 오늘 학습 여정을 시작하셨네요. 계속 하세요!
zh: 恭喜！您今天開始了學習之旅。繼續加油！

# quizResultExcellent
source: Excellent!
de: Ausgezeichnet!
es: ¡Excelente!
hi: उत्कृष्ट!
ko: 훌륭해요!
zh: 優秀！

# quizResultGoodJob
source: Good job!
de: Gut gemacht!
es: ¡Buen trabajo!
fr: Bon travail !
hi: बहुत अच्छा!
ko: 잘했어요!
zh: 做得好！

# quizResultNiceTry
source: Nice try!
de: Guter Versuch!
es: ¡Buen intento!
fr: Bien essayé !
hi: अच्छा प्रयास!
ko: 좋은 시도예요!
zh: 不錯的嘗試！

# quizResultKeepPracticing
source: Keep practicing!
de: Weiter üben!
es: ¡Sigue practicando!
fr: Continuez à pratiquer !
hi: अभ्यास जारी रखें!
ko: 계속 연습하세요!
zh: 繼續練習！

# quizCompleteMessage
source: You've finished the vocabulary quiz.
de: Sie haben den Vokabeltest abgeschlossen.
es: Has terminado el cuestionario de vocabulario.
fr: Vous avez terminé le quiz de vocabulaire.
hi: आपने शब्दावली प्रश्नोत्तरी पूरी कर ली है।
ko: 단어 퀴즈를 완료하셨습니다.
zh: 您已完成單字測驗。

# coinsEarned
source: {count} coins earned
de: {count} Münzen verdient
es: {count} monedas ganadas
fr: {count} pièces gagnées
hi: {count} सिक्के अर्जित किए
ko: {count}개의 코인을 획득했습니다
zh: 獲得 {count} 個金幣

# quizResultSummary
source: You answered {correct} out of {total} questions correctly.
de: Sie haben {correct} von {total} Fragen richtig beantwortet.
es: Has respondido {correct} de {total} preguntas correctamente.
fr: Vous avez répondu correctement à {correct} questions sur {total}.
hi: आपने {correct} प्रश्नों में से {total} प्रश्नों के सही उत्तर दिए।
ko: 총 {total}문제 중 {correct}문제를 맞히셨습니다.
zh: 您在 {total} 題中答對了 {correct} 題。

source: Play Again
de: Erneut spielen
es: Jugar de nuevo
fr: Rejouer
hi: फिर से खेलें
ko: 다시 하기
zh: 再玩一次

source: Home
de: Startseite
es: Inicio
fr: Accueil
hi: होम
ko: 홈
zh: 首頁

# exitConfirmationTitle
source: Are you sure you want to exit?
de: Sind Sie sicher, dass Sie beenden möchten?
es: ¿Estás seguro de que quieres salir?
fr: Êtes-vous sûr de vouloir quitter ?
hi: क्या आप वाकई बाहर निकलना चाहते हैं?
ko: 정말 종료하시겠습니까?
zh: 您確定要退出嗎？

# exitConfirmationMessage
source: Your progress will not be saved.
de: Ihr Fortschritt wird nicht gespeichert.
es: Tu progreso no se guardará.
fr: Votre progression ne sera pas sauvegardée.
hi: आपकी प्रगति सहेजी नहीं जाएगी।
ko: 진행 상황이 저장되지 않습니다.
zh: 您的進度將不會被儲存。

source: Exit
de: Beenden
es: Salir
fr: Quitter
hi: बाहर निकलें
ko: 종료
zh: 退出

# continueAction
source: Continue
de: Weiter
es: Continuar
fr: Continuer
hi: जारी रखें
ko: 계속
zh: 繼續

source: Vocabulary Quiz
de: Vokabeltest
es: Cuestionario de Vocabulario
fr: Quiz de Vocabulaire
hi: शब्दावली प्रश्नोत्तरी
ko: 단어 퀴즈
zh: 單字測驗

# selectCorrectWord
source: Select the correct word to complete the sentence.
de: Wählen Sie das richtige Wort, um den Satz zu vervollständigen.
es: Selecciona la palabra correcta para completar la oración.
fr: Sélectionnez le mot correct pour compléter la phrase.
hi: वाक्य को पूरा करने के लिए सही शब्द चुनें।
ko: 문장을 완성할 올바른 단어를 선택하세요.
zh: 選擇正確的單字來完成句子。

source: Next
de: Weiter
es: Siguiente
fr: Suivant
hi: अगला
ko: 다음
zh: 下一個

source: Finish
de: Beenden
es: Terminar
fr: Terminer
hi: समाप्त करें
ko: 완료
zh: 完成

# noQuizQuestions
source: No quiz questions available
de: Keine Fragen verfügbar
es: No hay preguntas disponibles
fr: Aucune question disponible
hi: कोई प्रश्न उपलब्ध नहीं है
ko: 사용 가능한 퀴즈 문제가 없습니다
zh: 沒有可用的測驗題目

# errorWithMessage
source: Error: {message}
de: Fehler: {message}
fr: Erreur : {message}
hi: त्रुटि: {message}
ko: 오류: {message}
zh: 錯誤：{message}

# commitmentPactTitle
source: Commitment Pact
de: Verpflichtungspakt
es: Pacto de Compromiso
fr: Pacte d'Engagement
hi: प्रतिबद्धता का वचन
ko: 학습 다짐
zh: 學習承諾

# commitmentPactIntro
source: I want to
de: Ich möchte
es: Quiero
fr: Je veux
hi: मैं चाहता हूं
ko: 저는
zh: 我想要

# commitmentPactInnerNeeds
source: stay connected to my inner needs
de: mit meinen inneren Bedürfnissen verbunden bleiben
es: mantenerme conectado con mis necesidades internas
fr: rester connecté à mes besoins intérieurs
hi: अपनी आंतरिक जरूरतों से जुड़े रहना
ko: 내면의 필요와 연결되고 싶습니다
zh: 與內心需求保持連結

# commitmentPactByLearning
source: by learning
de: durch das Lernen von
es: aprendiendo
fr: en apprenant
hi: सीखकर
ko: . 매일
zh: ，透過每天學習

# commitmentPactWordsPerDay
source: {count} words per day
de: {count} Wörtern täglich
es: {count} palabras por día
fr: {count} mots par jour
hi: {count} शब्द प्रतिदिन
ko: {count}개의 단어를 학습하여
zh: {count} 個單字

# commitmentPactHelpBecome
source: to help me become
de: um mir zu helfen, ein
es: para ayudarme a convertirme en
fr: pour m'aider à devenir
hi: मुझे बनने में मदद करने के लिए
zh: ，幫助我成為

# commitmentPactVocabularyMaster
source: vocabulary master.
de: Vokabelmeister zu werden.
es: maestro del vocabulario.
fr: maître du vocabulaire.
hi: शब्दावली के मास्टर।
ko: 단어 달인이 되고 싶습니다.
zh: 單字達人。

# commitmentPactTestChampion
source: test champion.
de: Testchampion zu werden.
es: campeón de exámenes.
fr: champion des tests.
hi: परीक्षा के चैंपियन।
ko: 시험 챔피언이 되고 싶습니다.
zh: 考試冠軍。

# commitmentPactCareerAchiever
source: career achiever.
de: beruflich erfolgreich zu werden.
es: triunfador profesional.
fr: professionnel accompli.
hi: कैरियर में सफल।
ko: 경력 성취자가 되고 싶습니다.
zh: 職涯成功者。

# commitmentPactLifelongLearner
source: lifelong learner.
de: lebenslang Lernender zu werden.
es: aprendiz de por vida.
fr: apprenant à vie.
hi: जीवन भर का शिक्षार्थी।
ko: 평생 학습자가 되고 싶습니다.
zh: 終身學習者。

# commitmentPactTrust
source: I want and trust Wordstock AI to guide me along the way and help me accomplish all my resolutions.
de: Ich möchte und vertraue darauf, dass Wordstock AI mich führt und mir hilft, alle meine Verpflichtungen zu erfüllen.
es: Quiero y confío en que Wordstock AI me guíe en el camino y me ayude a cumplir todas mis resoluciones.
fr: Je veux et je fais confiance à Wordstock AI pour me guider et m'aider à atteindre toutes mes résolutions.
hi: मैं चाहता हूं और मुझे विश्वास है कि वर्डस्टॉक AI मुझे मार्गदर्शन करेगा और मेरी सभी प्रतिबद्धताओं को पूरा करने में मेरी मदद करेगा।
ko: 저는 Wordstock AI가 저를 안내하고 모든 목표를 달성하는 데 도움을 줄 것이라고 믿고 원합니다.
zh: 我願意並相信 Wordstock AI 會引導我前進，幫助我實現所有的目標。

# commitmentPactButton
source: I commit to my Goals
de: Ich verpflichte mich, meine Ziele zu erreichen
es: Me comprometo con mis Metas
fr: Je m'engage à atteindre mes Objectifs
hi: मैं अपने लक्ष्यों के प्रति प्रतिबद्ध हूं
ko: 목표 달성을 다짐합니다
zh: 我承諾達成目標

# commitmentCongratulationsTitle
source: Congratulations!
de: Glückwunsch!
es: ¡Felicidades!
fr: Félicitations !
hi: बधाई हो!
ko: 축하합니다!
zh: 恭喜！

# commitmentCongratulationsMessage
source: You've taken the first step on your vocabulary learning journey. Your commitment will help you reach your goals!
de: Sie haben den ersten Schritt auf Ihrer Vokabellernreise gemacht. Ihre Verpflichtung wird Ihnen helfen, Ihre Ziele zu erreichen!
es: Has dado el primer paso en tu viaje de aprendizaje de vocabulario. ¡Tu compromiso te ayudará a alcanzar tus metas!
fr: Vous avez fait le premier pas dans votre parcours d'apprentissage du vocabulaire. Votre engagement vous aidera à atteindre vos objectifs !
hi: आपने शब्दावली सीखने की अपनी यात्रा में पहला कदम उठाया है। आपकी प्रतिबद्धता आपको अपने लक्ष्यों को प्राप्त करने में मदद करेगी!
ko: 단어 학습 여정의 첫 걸음을 내디뎠습니다. 귀하의 다짐이 목표 달성에 도움이 될 것입니다!
zh: 您已踏出單字學習之旅的第一步。您的承諾將幫助您達成目標！

# nextButton
source: Next
de: Weiter
es: Siguiente
fr: Suivant
hi: अगला
ko: 다음
zh: 下一個

# goalSelectionTitle
source: What is your primary learning goal?
de: Was ist Ihr Hauptlernziel?
es: ¿Cuál es tu objetivo principal de aprendizaje?
fr: Quel est votre objectif principal d'apprentissage ?
hi: आपका मुख्य सीखने का लक्ष्य क्या है?
ko: 주요 학습 목표는 무엇인가요?
zh: 您的主要學習目標是什麼？

# goalSelectionDescription
source: Select the goal that best describes your main learning objective.
de: Wählen Sie das Ziel, das Ihr Hauptlernziel am besten beschreibt.
es: Selecciona el objetivo que mejor describa tu principal objetivo de aprendizaje.
fr: Sélectionnez l'objectif qui décrit le mieux votre principal objectif d'apprentissage.
hi: वह लक्ष्य चुनें जो आपके मुख्य सीखने के लक्ष्य का सबसे अच्छा वर्णन करता है।
ko: 주요 학습 목표를 가장 잘 설명하는 항목을 선택하세요.
zh: 選擇最符合您主要學習目標的選項。
